package org.example.Kotlin.StepicKotlin.task1
/*
* В недалеком будущем человечество совершило контакт с разумными жителями созвездия Жука.
* Пришельцы отлично понимают английский язык, однако культ этикета у них доведен до абсурда,
* поэтому любой человек отклонившийся от официальной формы приветствия будет съеден на месте.
* Напишите программу, выводящую на экран каноническую форму приветствия для жителей созвездия Жука:
*
* Out:
* Hello brave citizen of glorious Bug Kingdom!
* */

fun main(args : Array<String>) {
    println("Hello brave citizen of glorious Bug Kingdom!")
}